docs: add mermaid to packages
Signed-off-by: Andres Vallecilla <andresfelipe083195@hotmail.com>
